<?php
$content_fn = [
    'OOO РИК' => [
        'Шифровальное (криптографическое) средство защиты фискальных данных фискальный накопитель ФН-1' => 'Шифровальное (криптографическое) средство защиты фискальных данных фискальный накопитель ФН-1',
        'Шифровальное (криптографическое) средство защиты фискальных данных фискальный накопитель «ФН-1» исполнение 2' => 'Шифровальное (криптографическое) средство защиты фискальных данных фискальный накопитель «ФН-1» исполнение 2',
    ],
    'OOO НТЦ Измеритель' => [
        'Средство криптографической защиты фискальных данных «ФН-1» исполнение 3 версия 1' => 'Средство криптографической защиты фискальных данных «ФН-1» исполнение 3 версия 1',
        'Шифровальное (криптографическое) средство защиты фискальных данных фискальный накопитель «ФН-1» исполнение Из13-2' => 'Шифровальное (криптографическое) средство защиты фискальных данных фискальный накопитель «ФН-1» исполнение Из13-2',
        'Шифровальное (криптографическое) средство защиты фискальных данных фискальный накопитель «ФН-1.1» исполнение Из15-2' => 'Шифровальное (криптографическое) средство защиты фискальных данных фискальный накопитель «ФН-1.1» исполнение Из15-2',
     ],
    'OOO Прагматик' => [
        'Средство криптографической защиты фискальных данных «ФН-1» исполнение 3 версия 2' => 'Средство криптографической защиты фискальных данных «ФН-1» исполнение 3 версия 2',
        'Шифровальное (криптографическое) средство защиты фискальных данных фискальный накопитель «ФН-1» исполнение Пр13-2' => 'Шифровальное (криптографическое) средство защиты фискальных данных фискальный накопитель «ФН-1» исполнение Пр13-2',
        'Шифровальное (криптографическое) средство защиты фискальных данных фискальный накопитель «ФН-1.1» исполнение Пр15-2' => 'Шифровальное (криптографическое) средство защиты фискальных данных фискальный накопитель «ФН-1.1» исполнение Пр15-2',
     ],
    'АО КОНЦЕРН АВТОМАТИКА' => [
        'Шифровальное (криптографическое) средство защиты фискальных данных фискальный накопитель «ФН-1.1» исполнение 3' => 'Шифровальное (криптографическое) средство защиты фискальных данных фискальный накопитель «ФН-1.1» исполнение 3',
        'Шифровальное (криптографическое) средство защиты фискальных данных фискальный накопитель «ФН-1.1» исполнение Ав15-2' => 'Шифровальное (криптографическое) средство защиты фискальных данных фискальный накопитель «ФН-1.1» исполнение Ав15-2',
        'Шифровальное (криптографическое) средство защиты фискальных данных фискальный накопитель «ФН-1.1» исполнение Ав36-2' => 'Шифровальное (криптографическое) средство защиты фискальных данных фискальный накопитель «ФН-1.1» исполнение Ав36-2',
    ],
    'OOO ИНВЕНТА' => [
        'Шифровальное (криптографическое) средство защиты фискальных данных фискальный накопитель «ФН-1.1» исполнение 5-15-2' => 'Шифровальное (криптографическое) средство защиты фискальных данных фискальный накопитель «ФН-1.1» исполнение 5-15-2',
        'Шифровальное (криптографическое) средство защиты фискальных данных фискальный накопитель «ФН-1.1» исполнение 4' => 'Шифровальное (криптографическое) средство защиты фискальных данных фискальный накопитель «ФН-1.1» исполнение 4',
        'Шифровальное (криптографическое) средство защиты фискальных данных фискальный накопитель «ФН-1.1» исполнение 5-15-1' => 'Шифровальное (криптографическое) средство защиты фискальных данных фискальный накопитель «ФН-1.1» исполнение 5-15-1',
        'Шифровальное (криптографическое) средство защиты фискальных данных фискальный накопитель «ФН-1.1» исполнение 2' => 'Шифровальное (криптографическое) средство защиты фискальных данных фискальный накопитель «ФН-1.1» исполнение 2',
    ],
    'OOO ЭВОТОР' => [
        'Шифровальное (криптографическое) средство защиты фискальных данных фискальный накопитель «ФН-1.1» исполнение Эв15-2' => 'Шифровальное (криптографическое) средство защиты фискальных данных фискальный накопитель «ФН-1.1» исполнение Эв15-2',
        'Шифровальное (криптографическое) средство защиты фискальных данных фискальный накопитель «ФН-1.1» исполнение Эв36-2' => 'Шифровальное (криптографическое) средство защиты фискальных данных фискальный накопитель «ФН-1.1» исполнение Эв36-2',
    ],
    'OOO Дримкас' => [
        'Шифровальное (криптографическое) средство защиты фискальных данных фискальный накопитель «ФН-1.1» исполнение 6-15-2' => 'Шифровальное (криптографическое) средство защиты фискальных данных фискальный накопитель «ФН-1.1» исполнение 6-15-2'
    ],
];